app/controllers/books_controller.rb

  def index
    @books = Book.all.order(params[:sort])
---
SELECT "books".* FROM "books"

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at", "rate") VALUES (?, ?, ?, ?, ?, ?)  [["title", "最高"], ["body", "saikouです"], ["user_id", 1], ["created_at", "2021-06-07 19:17:30.917717"], ["updated_at", "2021-06-07 19:17:30.917717"], ["rate", 5.0]]